tutorials4NF/phaseChangeMaterial4NF/cavityMonoHomogenous/constant/nanoFluidProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      nanoFluidProperties;
}
//------------------------------- nanoFluid4Foam project -------------------------------//
//Author
    //Ehsan Golab, SUT. All rights reserved.
    //Ehsan1996Golab@gmail.com

//--------------------------------------------------------------------------------------//


//************************************************ baseFluid ************************************************//
baseFluid			(lauricAcid);
moleFraction			(1.0);
#include "../../../materialsDict.H";
transportModel			Newtonian;


//************************************************ particle ************************************************//
particle			( (MWCNT MNP) );
particleDict
{
    MWCNT
    {
        Components		(MWCNT);
        moleFraction		(1.0);
    }
}


//************************************************ nanoFluid ************************************************//
nanoFluidModel			(mono Homogenous);
thermalConductivityModel	NanCNTC;
NanCNTCCoeffs
{
    Rk Rk [ -1 0 3 1 0 0 0 ]	8e-8;
    lcnt lcnt [ 0 1 0 0 0 0 0 ]	5e-6;
    dcnt dcnt [ 0 1 0 0 0 0 0 ]	100e-9;
}

dynamicViscosityModel		Brinkman;
BrinkmanCoeffs{}


//***************** Heterogeneous *****************//
brownianDiffusivityModel	Brownian;
BrownianCoeffs
{
    dnp				(33.0e-9);
}

thermophoresisDiffusivityModel		McNabMeisen;
McNabMeisenCoeffs{}


//############################################### End #######################################################//
