tutorials4NF/phaseChangeMaterial4NF/cavityMonoHomogenous/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.01;

vertices
(
    (0 0 -0.1)
    (5.0 0 -0.1)
    (5.0 12.0 -0.1)
    (0 12.0 -0.1)
    (0 0 0.1)
    (5.0 0 0.1)
    (5.0 12.0 0.1)
    (0 12.0 0.1)
);

edges
(
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (100 240 1) simpleGrading (1 1 1)
);

boundary
(
    top
    {
        type wall;
        faces
        (
            (2 3 7 6)
        );
    }

    bottom
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (4 5 6 7)
            (3 2 1 0)
        );
    }

    right
    {
        type wall;
        faces
        (
            (6 5 1 2)
        );
    }

    left
    {
        type wall;
        faces
        (
            (4 7 3 0)
        );
    }
);

mergePatchPairs
(
);
// ************************************************************************* //
